import streamlit as st

st.header("ИТОГ! :gorilla:")

st.write("Теперь пройдемся четко по критериям.")

st.write("'Обработка данных с помощью pandas' — обработал и много. Использовал всякие там .iterrows(), apply(lambda). regex и так далее. Короче кучу всего — 2 балла")

st.write("'Веб-скреппинг' — использовал сложного паучка из Scrapy — 2 балла")

st.write("'Работа с REST API (XML/JSON)' — Обошел защиту внутреннего API ЦИАНа и достал геоданные и цены всей недвижимости на продажу — 2 балла")

st.write("'Визуализация данных' — вряд ли ваши глаза видели что-то более красивое чем графы с третьей страницы — 2 балла")

st.write("'Математические возможности Python (содержательное использование numpy/scipy, SymPy и т.д. для решения математических задач)' — логарифмировал данные с помощью numpy — 1 балл")

st.write("'Streamlit' — на месте :otter: — 1 балл")

st.write("'SQL' — кучу раз использовал. И в боте, и на третьей странице — 1 балл")

st.write("'Регулярные выражения (для решения задач, для которых трудно придумать простое решение без регулярных выражений)' — на четвертой странице все работает ли благодаря этому подарку прогресса — 1 балл")

st.write("'Работа с геоданными с помощью geopandas, shapely, folium и т.д.' — все три использовал и не раз — 1 балл")

st.write("'Машинное обучение (построение предсказательных моделей типа регрессий или решающих деревьев)' — целую страницу этой дичи посвятил — 1 балл")

st.write("'Работа с графами (библиотека networkx)' — все на третьей странице — 1 балл")

st.write("'Дополнительные технологии (библиотеки, не обсуждавшиеся в ходе курса — например, телеграм-боты, нейросети или ещё что-нибудь)' — сделал бота, использовал кучу небольших модулей для стримлита, разобрался в network(не путать с networkx) — 2 балла")

st.write("'Объём (осмысленных строк кода, не считая import)' — строк точно > даже 230 — 1 балл")

st.write("'Целостность проекта' — тут уже спорно, но +- тема общая есть, поэтому — 1 балл ")

st.write("'Общее впечатление' — я тебя по айпи вычислю — 1 балл")